-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- 主機： 127.0.0.1
-- 產生時間： 2025-07-19 13:46:33
-- 伺服器版本： 10.4.32-MariaDB
-- PHP 版本： 8.0.30

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `finance_tracker`
--

-- --------------------------------------------------------

--
-- 資料表結構 `financial_records`
--

CREATE TABLE `financial_records` (
  `id` int(11) NOT NULL,
  `date` date DEFAULT NULL,
  `currency` varchar(10) DEFAULT NULL,
  `amount` decimal(10,2) DEFAULT NULL,
  `category` varchar(50) DEFAULT NULL,
  `subcategory` varchar(50) DEFAULT NULL,
  `brand` varchar(50) DEFAULT NULL,
  `description` varchar(255) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- 傾印資料表的資料 `financial_records`
--

INSERT INTO `financial_records` (`id`, `date`, `currency`, `amount`, `category`, `subcategory`, `brand`, `description`) VALUES
(1, '2025-05-16', '港币', 8.00, '会员订阅', '氪金', '', ''),
(2, '2025-05-15', '港币', 47.00, '动漫娱乐', '书籍', '', ''),
(3, '2025-05-07', '人民币', 20.24, '饮食消费', '饮料', '喜茶', ''),
(4, '2025-05-14', '港币', 114.00, '饮食消费', '零食', '', 'pizza'),
(5, '2025-05-13', '人民币', 30.00, '会员订阅', '氪金', '', '三角洲'),
(6, '2025-03-28', '人民币', 23.00, '饮食消费', '饮料', '喜茶', ''),
(7, '2025-05-12', '人民币', 3.00, '饮食消费', '零食', '', '烤肉'),
(8, '2025-03-21', '人民币', 51.04, '饮食消费', '饮料', '喜茶', ''),
(9, '2025-05-12', '港币', 26.50, '交通出行', 'MTR', '', ''),
(10, '2025-05-12', '港币', 26.50, '交通出行', 'MTR', '', ''),
(11, '2025-05-12', '港币', 22.30, '交通出行', '巴士', '', ''),
(12, '2025-05-12', '人民币', 51.00, '饮食消费', '零食', '', '烤肉'),
(13, '2025-05-12', '人民币', 1149.80, '生活开销', '', '', '眼镜'),
(14, '2025-03-11', '人民币', 20.24, '饮食消费', '饮料', '喜茶', ''),
(15, '2025-05-11', '港币', 7.60, '交通出行', 'MTR', '', ''),
(16, '2025-05-11', '港币', 9.00, '饮食消费', '零食', '优品360', ''),
(17, '2025-05-11', '人民币', 377.72, '收入来源', '闲鱼', '', 'b70'),
(18, '2025-02-21', '人民币', 20.24, '饮食消费', '零食', '喜茶', ''),
(19, '2025-02-09', '人民币', 18.80, '饮食消费', '饮料', '喜茶', ''),
(20, '2025-05-10', '港币', 7.60, '交通出行', 'MTR', '', ''),
(21, '2025-05-10', '港币', 115.60, '动漫娱乐', '漫画', '', ''),
(22, '2025-05-10', '港币', 180.00, '动漫娱乐', '手办', '', ''),
(23, '2025-05-09', '港币', 26.30, '交通出行', '巴士', '', ''),
(24, '2025-01-25', '人民币', 3.00, '饮食消费', '饮料', '喜茶', ''),
(25, '2025-01-25', '人民币', 18.34, '饮食消费', '饮料', '喜茶', ''),
(26, '2025-05-07', '人民币', 5.16, '交通出行', '', '', ''),
(27, '2025-05-07', '港币', 9.90, '交通出行', '小巴', '', ''),
(28, '2025-05-07', '港币', 9.90, '交通出行', '小巴', '', ''),
(29, '2025-05-07', '港币', 22.30, '交通出行', '巴士', '', ''),
(30, '2025-05-07', '人民币', 27.00, '网络购物', '运费', '', '快递'),
(31, '2025-05-07', '人民币', 33.00, '饮食消费', '零食', '', '烤肉'),
(32, '2025-01-07', '人民币', 3.00, '饮食消费', '饮料', '喜茶', ''),
(33, '2025-05-04', '港币', 32.40, '交通出行', '巴士', '', ''),
(34, '2025-01-07', '人民币', 17.15, '饮食消费', '饮料', '喜茶', ''),
(35, '2025-01-05', '人民币', 20.24, '饮食消费', '饮料', '喜茶', ''),
(36, '2025-05-04', '日元', 388.00, '旅行消费', '横滨之旅', '', '电车'),
(37, '2025-05-04', '日元', 1500.00, '旅行消费', '横滨之旅', '', '打包'),
(38, '2025-05-03', '港币', 78.00, '旅行消费', '横滨之旅', '', '电话卡'),
(39, '2025-05-03', '港币', 37.84, '旅行消费', '横滨之旅', '', '存储柜'),
(40, '2025-05-03', '港币', 37.84, '旅行消费', '横滨之旅', '', '存储柜'),
(41, '2025-05-03', '日元', 439.00, '旅行消费', '横滨之旅', '', '电车'),
(42, '2025-05-03', '日元', 208.00, '旅行消费', '横滨之旅', '', '电车'),
(43, '2025-05-03', '日元', 230.00, '旅行消费', '横滨之旅', '', '电车'),
(44, '2025-05-03', '日元', 178.00, '旅行消费', '横滨之旅', '', '电车'),
(45, '2025-05-03', '日元', 178.00, '旅行消费', '横滨之旅', '', '电车'),
(46, '2025-05-03', '日元', 74.00, '旅行消费', '横滨之旅', '', '电车'),
(47, '2025-05-03', '日元', 178.00, '旅行消费', '横滨之旅', '', '电车'),
(48, '2025-05-03', '日元', 3500.00, '旅行消费', '横滨之旅', '', '应援棒'),
(49, '2024-12-29', '人民币', 20.24, '饮食消费', '饮料', '喜茶', ''),
(50, '2025-05-03', '港币', 1025.95, '旅行消费', '横滨之旅', '', '塔店');

-- --------------------------------------------------------

--
-- 資料表結構 `templates`
--

CREATE TABLE `templates` (
  `id` int(11) NOT NULL,
  `name` varchar(100) NOT NULL,
  `currency` varchar(10) NOT NULL,
  `amount` decimal(10,2) NOT NULL,
  `category` varchar(50) NOT NULL,
  `subcategory` varchar(50) DEFAULT NULL,
  `brand` varchar(50) DEFAULT NULL,
  `description` varchar(255) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `financial_records`
--
ALTER TABLE `financial_records`
  ADD PRIMARY KEY (`id`);

--
-- 資料表索引 `templates`
--
ALTER TABLE `templates`
  ADD PRIMARY KEY (`id`);

--
-- 在傾印的資料表使用自動遞增(AUTO_INCREMENT)
--

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `financial_records`
--
ALTER TABLE `financial_records`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `templates`
--
ALTER TABLE `templates`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
